package com.company;




import java.util.Arrays;

public class Main {


    public static void main(String[] args) {
//       1. Задать целочисленный массив, состоящий из элементов 0 и 1. Например: [ 1, 1, 0, 0, 1, 0, 1, 1, 0, 0 ]. С помощью цикла и условия заменить 0 на 1, 1 на 0;
//        int[] arr = {1, 1, 0, 0, 1, 0, 1, 1, 0, 0};
//        for (int i=0; i < arr.length; i++){
//            if (arr[i] == 0) {
//                arr[i]++;
//            } else {
//                arr[i]--;
//            }
//
//        }
//        System.out.print(Arrays.toString(arr));


//     2. Задать пустой целочисленный массив размером 8. С помощью цикла заполнить его значениями 0 3 6 9 12 15 18 21;
//        int[] arr = new int[8];
//        for(int i = 0; i <arr.length; i++){
//            arr[i] =i*3;
//        }
//        System.out.println(Arrays.toString(arr));


//       3. Задать массив [ 1, 5, 3, 2, 11, 4, 5, 2, 4, 8, 9, 1 ] пройти по нему циклом, и числа меньшие 6 умножить на 2;
//        int[] arr = {1, 5, 3, 2, 11, 4, 5, 2, 4, 8, 9, 1};
//        for(int i=0; i < arr.length; i++){
//            if(arr[i] < 6){
//                arr[i]*=2;
//            }
//
//        }
//        System.out.print(Arrays.toString(arr));


//        4. Создать квадратный двумерный целочисленный массив (количество строк и столбцов одинаковое), и с помощью цикла(-ов) заполнить его диагональные элементы единицами;
//        int[][] matrix = new int[3][3];
//        for(int i = 0; i<matrix.length; i++){
//            for(int j = 0;j<matrix[i].length;j++){
//                if (i==j||i+j==2){
//                    matrix[i][j]=1;
//                }
//                System.out.print(matrix[i][j]+" ");
//            }
//            System.out.println();
//        }


        //5. ** Задать одномерный массив и найти в нем минимальный и максимальный элементы (без помощи интернета);
//        //
//                int [] arr = new int[10];
//                int max = 0;
//                int min = 100;
//
//                for (int i = 0; i < arr.length; i++) {
//                    arr[i] = (int)(Math.random()*100);
//                    if(max <= arr[i]){
//                        max = arr[i];
//                   }
//                    if(min >= arr[i]){
//                        min = arr[i];
//                   }
//                }
//
//                System.out.println("Максимальный элемент: " + max+"\nМинимальный элемент: "+min);


//  6. ** Написать метод, в который передается не пустой одномерный целочисленный массив, метод должен вернуть true,
// если в массиве есть место, в котором сумма левой и правой части массива равны.
// Примеры: checkBalance([2, 2, 2, 1, 2, 2, || 10, 1]) → true, checkBalance([1, 1, 1, || 2, 1]) → true,
// граница показана символами ||, эти символы в массив не входят






    }


}


